# config.py
# Токен бота
BOT_TOKEN = '7092147073:AAENCu6Y05RRDx1Q0l5rx2vo3PL-ObvYIx0'  # Замените на свой токен

# Имя бота для отображения в сообщениях
BOT_NAME = 'PARTNERS 🔗'

# Настраиваемое приветственное сообщение (может быть изменено администратором)
WELCOME_MESSAGE = f"""Добро пожаловать в PARTNERS 🔗

♻️ Мы занимаемся созданием своей экосистемы для эффективной и комфортной торговли.  
Если Вам порекомендовали Портал, отпишите сюда: RICK: 
http://t.me/+94716192650

🤖 Данный бот поможет:
— Поддерживать связь и обновлять ссылки в разы быстрее.
— Получать свежую информацию по проекту.



🔗 Основные ресурсы
— PORTAL8.INFO, 
— ТГ-ресурс Вы можете открыть через баннер сайта, т.к. ссылка на ТГ динамичная.

❗️Прошу не отключать уведомление на данном боте, так как это может стать препятствием в связи.

🗓 Планы на ближайшее время:
— Систематизировать доступ к информации. В том числе с помощью «PARTNERS 🔗»
— Автоматизировать рекламные посты в Портале, а потом и в целом для магазинов Портала и на других площадках.
— Разработка бота с магазинами в TG, который будет брать данные с сайта. (Закреп в боте) 

⭕️ Также мы в поиске инвестора под один проект, который держим в секрете. Если интересно — отпишите Рику. 

Желаю хорошего дня!"""

# ID админов (список Telegram ID администраторов)
ADMIN_IDS = [
    8093896404,  # Замените на реальные ID
    5363798844,
    7874016205
]

# Настройки базы данных
DATABASE_PATH = 'bot_database.db'

# ID канала для отправки уведомлений
CHANNEL_ID = '-1002542068593'  # Замените на ID вашего канала